------------------------------------------------------------------------------------------------------------------
-----------------ureport的表格与实际的表格关联关系
------------------------------------------------------------------------------------------------------------------

select  ind.title, dic.table_ename  , dic.table_name,  ind.table_name
from t_report_index ind
left join (select distinct table_name,TABLE_ENAME 
from T_ACCOUNT_DICT) dic on dic.table_name = ind.title;


------------------------------------------------------------------------------------------------------------------
-----------------更新ureport的表格与实际的表格关联关系----------------------------------------------------------
------------------------------------------------------------------------------------------------------------------
--update t_report_index b set table_name = (select distinct table_ename from T_ACCOUNT_DICT a where  a.table_name = b.title  );
